CalculationRegisters/ЖурналНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<CalculationRegister>
		<Properties>
			<Name>ЖурналНачислений</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>false</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.Начисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

CommonModules/Расчет/Ext/Module.bsl
Процедура РассчитатьЗаписи(Регистратор) Экспорт 
	
	НаборЗаписей = РегистрыРасчета.ЖурналНачислений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
	НаборЗаписей.Прочитать();
	
	Для каждого Запись Из НаборЗаписей Цикл
		
		Если Запись.ВидРасчета = ПланыВидовРасчета.Начисления.ОкладСуммой Тогда
			Запись.Сумма = Запись.Параметр; 
		ИначеЕсли Запись.ВидРасчета = ПланыВидовРасчета.Начисления.ПремияПроцентом Тогда 
			МассивРесурсов = Новый Массив(1);
			МассивРесурсов[0] = "ЖурналНачислений.Сумма";
			
			СтруктураИзмерений = Новый Структура;
			СтруктураИзмерений.Вставить("Сотрудник", "ЖурналНачислений.Сотрудник");
			
			ТЗ_БАЗА = Запись.ПолучитьБазу(МассивРесурсов,СтруктураИзмерений);
			База = ТЗ_БАЗА[0].Сумма;
			Запись.Сумма = База * Запись.Параметр / 100;
		ИначеЕсли  Запись.ВидРасчета = ПланыВидовРасчета.Начисления.ПремияСуммой Тогда 
			 Запись.Сумма = Запись.Параметр;			
		КонецЕсли;
		
				
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
		
КонецПроцедуры
